In [1]:
import pandas as pd
pd.__version__

'0.25.1'

In [2]:
ser = pd.Series([1,2,3])
ser

0    1
1    2
2    3
dtype: int64

In [3]:
# 숫자 + 숫자 = 산술연산자
# 문자 + 문자 = 연결연산자

# 판다스 덧셈 연산 (각 행에 해당하는 숫자끼리 연산)

ser + ser

0    2
1    4
2    6
dtype: int64

In [4]:
ser.add(ser)

0    2
1    4
2    6
dtype: int64

In [5]:
# 검색과 슬라이싱

ser = pd.Series([1,2,3])
df = pd.DataFrame(ser) # 데이터 프레임의 행, 열 구조
df

   0
0  1
1  2
2  3

In [6]:
df[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [7]:
# 행 단위 데이터 출력, iloc = index location
df.iloc[0]

0    1
Name: 0, dtype: int64

In [8]:
# 행, 열 단위 데이터 출력
df.iloc[0,0]

1

In [9]:
# 열 단위로 뽑기
df[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [11]:
# 행, 열 단위로 뽑기
df[0][0]

1

In [12]:
df = pd.DataFrame(data=[[0,1,2],[3,4,5]], index=list('ab'),
                 columns=list('cde'))

In [13]:
df

   c  d  e
a  0  1  2
b  3  4  5

In [14]:
type(df.index)

pandas.core.indexes.base.Index

In [15]:
type(df.columns)

pandas.core.indexes.base.Index

In [16]:
type(df.values)

numpy.ndarray

In [17]:
type(df.iloc)

pandas.core.indexing._iLocIndexer

In [18]:
type(df.loc)

pandas.core.indexing._LocIndexer

In [19]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                 columns = list('abc'))

In [21]:
df_a = df

In [22]:
df_a

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [23]:
df_a['a'] = 100

In [24]:
df_a

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [25]:
df

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [26]:
id(df), id(df_a)

(2112705867336, 2112705867336)

In [27]:
df.values.base is df_a.values.base

True

In [28]:
# 숫자 데이터를 덧셈 연산하시면 각각의 값에 연산이 된다.
df_b = df + 99

In [29]:
df

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [30]:
df_b

     a    b    c
0  199  101  102
1  199  104  105
2  199  107  108

In [31]:
id(df_b), id(df) # df_a = df

(2112705901576, 2112705867336)

In [32]:
df_b.values.base is df.values.base # is(call by address), ==(call by value) 차이점

False

In [34]:
import numpy as np
s1 = pd.Series(index=list('abcd'), data=np.arange(4))
s1

a    0
b    1
c    2
d    3
dtype: int32

In [35]:
s2 = s1 # call by address (주소 복사)

In [36]:
s2

a    0
b    1
c    2
d    3
dtype: int32

In [37]:
s1 is s2

True

In [38]:
s3 = s1.copy() # call by value (값 복사)

In [39]:
s1 is s3

False

In [40]:
# 인덱싱 연산
# getitem

pd.Series.__getitem__

In [41]:
pd.DataFrame.__getitem__

In [42]:
pd.Index.__getitem__

In [43]:
pd.MultiIndex.__getitem__

In [44]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8]], index=['a','b'],
                 columns = ['가','나','다','라'])

In [45]:
df.loc.__getitem__

In [46]:
df.iloc.__getitem__

In [47]:
df

   가  나  다  라
a  1  2  3  4
b  5  6  7  8

In [48]:
df['나']

a    2
b    6
Name: 나, dtype: int64

In [49]:
df.__getitem__('나')

a    2
b    6
Name: 나, dtype: int64

In [50]:
ser = df['나']
ser

a    2
b    6
Name: 나, dtype: int64

In [51]:
ser['a']

2

In [52]:
ser['b']

6

In [53]:
ser.__getitem__(ser > 3)

b    6
Name: 나, dtype: int64

In [54]:
df.__getitem__(df > 3)

     가    나    다  라
a  NaN  NaN  NaN  4
b  5.0  6.0  7.0  8

In [55]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                 columns = list('abc'))
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [56]:
df1 = pd.DataFrame([[3,3,3],[3,3,3],[3,3,3]],
                  columns = list('abc'))

In [57]:
df1

   a  b  c
0  3  3  3
1  3  3  3
2  3  3  3

In [58]:
df + 3

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [59]:
df + df1

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [60]:
type(df.__add__)

method

In [61]:
type(df.__add__.__func__)

function

In [62]:
import numpy as np
df_na = pd.DataFrame([1,2,np.nan])
df_na

     0
0  1.0
1  2.0
2  NaN

In [63]:
df_na.sum()

0    3.0
dtype: float64

In [66]:
df_na.sum(skipna=True)

0    3.0
dtype: float64

In [65]:
df_na < 3

       0
0   True
1   True
2  False

In [67]:
df_sax = pd.Series([1,2,3,4])

In [68]:
df_sax

0    1
1    2
2    3
3    4
dtype: int64

In [69]:
df_sax.sum(axis=0)

10

In [70]:
df_dax = pd.DataFrame([[1,2,3,4],[5,6,7,8]])
df_dax

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [71]:
df_dax.sum(axis = 0)

0     6
1     8
2    10
3    12
dtype: int64

In [73]:
df_dax.sum(axis = 1)

0    10
1    26
dtype: int64

In [75]:
import numpy as np

df_1 = pd.DataFrame(np.random.randint(1,10,(3,3)), columns=list('ABC'))
df_1

   A  B  C
0  3  3  3
1  4  5  6
2  9  7  2

In [76]:
df_2 = pd.DataFrame(np.random.randint(1,10,(3,3)), columns=list('CAB'))

In [77]:
df_2

   C  A  B
0  1  9  4
1  1  3  4
2  9  3  1

In [78]:
np.log(df_2)

          C         A         B
0  0.000000  2.197225  1.386294
1  0.000000  1.098612  1.386294
2  2.197225  1.098612  0.000000

In [79]:
df_1 + df_2

    A  B   C
0  12  7   4
1   7  9   7
2  12  8  11

In [80]:
df_3 = pd.DataFrame(np.random.randint(1,10,(3,2)), columns = list('CB'))
df_3

   C  B
0  6  1
1  6  8
2  3  3

In [82]:
df_1

   A  B  C
0  3  3  3
1  4  5  6
2  9  7  2

In [81]:
df_1 + df_3

    A   B   C
0 NaN   4   9
1 NaN  13  12
2 NaN  10   5

In [83]:
# 한글 처리
!pip install chardet

Requirement already satisfied: chardet in c:\users\media-cam\anaconda3\lib\site-packages (3.0.4)

In [84]:
import chardet

In [85]:
def find_encoding(fname):
    r_file = open(fname, 'rb').read()
    result = chardet.detect(r_file)
    charenc = result['encoding']
    return charenc

In [86]:
my_encoding1 = find_encoding('./data/weight_loss.csv')
df_1 = pd.read_csv('./data/weight_loss.csv', encoding=my_encoding1)

In [87]:
my_encoding1

'EUC-KR'

In [88]:
try:
    pd.read_csv("./data/weight_loss.csv", encoding="utf-8")
    
except Exception as e:
    print(e)

'utf-8' codec can't decode byte 0xc0 in position 0: invalid start byte

In [89]:
df_1.head()

   이름   월   주  몸무게
0  지완  1월  1주   70
1  찬준  1월  1주   60
2  지완  1월  2주   69
3  찬준  1월  2주   59
4  지완  1월  3주   69

In [90]:
df_1.tail()

    이름   월   주  몸무게
27  찬준  4월  2주   53
28  지완  4월  3주   63
29  찬준  4월  3주   53
30  지완  4월  4주   62
31  찬준  4월  4주   52

In [91]:
my_encoding2 = find_encoding('./data/korea_movie_list.csv')
df_2 = pd.read_csv('./data/korea_movie_list.csv', encoding = my_encoding2)

In [92]:
my_encoding2

'CP949'

In [93]:
try:
    pd.read_csv("./data/korea_movie_list.csv", encoding="utf-8")
    
except Exception as e:
    print(e)

'utf-8' codec can't decode byte 0xc7 in position 0: invalid continuation byte

In [94]:
df_2.head(2)

,movie_code,title,title_Eng,show_time,produce_year,open_date,produce_state,type,nation,genre,director,actor,show_type,watch_grade
0,20185801,할로우 차일드,The Hollow Child,88.0,2017,20180802,개봉예정,장편,캐나다,공포(호러)/판타지,제레미 루터,NaN,NaN,15세이상관람가
1,20187649,죽음의 리무진,Glass Coffin,75.0,2016,20180816,개봉예정,장편,스페인,스릴러/공포(호러),하리츠 쥬빌라가,파울라 본템피,NaN,NaN

In [95]:
df_3 = pd.read_csv('./data/korea_movie_list.csv', engine = 'python')

In [96]:
df_3.head(2)

,movie_code,title,title_Eng,show_time,produce_year,open_date,produce_state,type,nation,genre,director,actor,show_type,watch_grade
0,20185801,할로우 차일드,The Hollow Child,88.0,2017,20180802,개봉예정,장편,캐나다,공포(호러)/판타지,제레미 루터,NaN,NaN,15세이상관람가
1,20187649,죽음의 리무진,Glass Coffin,75.0,2016,20180816,개봉예정,장편,스페인,스릴러/공포(호러),하리츠 쥬빌라가,파울라 본템피,NaN,NaN

In [98]:
try :
    pd.read_csv('./data/korea_movie_list.csv', engine = 'c')
except Exception as e :
    print(e)

'utf-8' codec can't decode byte 0xc7 in position 0: invalid continuation byte

In [103]:
url = 'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/attention.csv'

'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/attention.csv'

In [106]:
df_att = pd.read_csv(url, error_bad_lines = False)

In [107]:
df_att

    Unnamed: 0  subject attention  solutions  score
0            0        1   divided          1    2.0
1            1        2   divided          1    3.0
2            2        3   divided          1    3.0
3            3        4   divided          1    5.0
4            4        5   divided          1    4.0
5            5        6   divided          1    5.0
6            6        7   divided          1    5.0
7            7        8   divided          1    5.0
8            8        9   divided          1    2.0
9            9       10   divided          1    6.0
10          10       11   focused          1    6.0
11          11       12   focused          1    8.0
12          12       13   focused          1    6.0
13          13       14   focused          1    8.0
14          14       15   focused          1    8.0
15          15       16   focused          1    6.0
16          16       17   focused          1    7.0
17          17       18   focused          1    7.0
18          18       19   focused          1    5.0
19          19       20   focused          1    6.0
20          20        1   divided          2    4.0
21          21        2   divided          2    4.0
22          22        3   divided          2    5.0
23          23        4   divided          2    7.0
24          24        5   divided          2    5.0
25          25        6   divided          2    5.0
26          26        7   divided          2    4.5
27          27        8   divided          2    7.0
28          28        9   divided          2    3.0
29          29       10   divided          2    5.0
30          30       11   focused          2    5.0
31          31       12   focused          2    9.0
32          32       13   focused          2    5.0
33          33       14   focused          2    8.0
34          34       15   focused          2    8.0
35          35       16   focused          2    8.0
36          36       17   focused          2    7.0
37          37       18   focused          2    8.0
38          38       19   focused          2    6.0
39          39       20   focused          2    6.0
40          40        1   divided          3    7.0
41          41        2   divided          3    5.0
42          42        3   divided          3    6.0
43          43        4   divided          3    5.0
44          44        5   divided          3    8.0
45          45        6   divided          3    6.0
46          46        7   divided          3    6.0
47          47        8   divided          3    8.0
48          48        9   divided          3    7.0
49          49       10   divided          3    6.0
50          50       11   focused          3    6.0
51          51       12   focused          3    8.0
52          52       13   focused          3    9.0
53          53       14   focused          3    7.0
54          54       15   focused          3    7.0
55          55       16   focused          3    7.0
56          56       17   focused          3    6.0
57          57       18   focused          3    6.0
58          58       19   focused          3    6.0
59          59       20   focused          3    5.0

In [108]:
df_att.head()

   Unnamed: 0  subject attention  solutions  score
0           0        1   divided          1    2.0
1           1        2   divided          1    3.0
2           2        3   divided          1    3.0
3           3        4   divided          1    5.0
4           4        5   divided          1    4.0

In [112]:
df_att.drop('Unnamed: 0',axis=1).head()

   subject attention  solutions  score
0        1   divided          1    2.0
1        2   divided          1    3.0
2        3   divided          1    3.0
3        4   divided          1    5.0
4        5   divided          1    4.0